# TODO написать нормальную информацию о проекте
ABOUT = """Данный бот призван помочь преподавателям
получать обратную связь от студентов. Для начала
работы с ботом введите /register чтобы зарегистрироваться."""

HELP = """**Список доступных команд:**

/begin - когда нужно начать опрос
/help - чтобы получить список доступных комманд
/stop - чтобы в любой момент сбросить диалог в исходное состояние
/register - чтобы зарегистрироваться как студент или как преподаватель
/about - Чтобы побольше узнать о проекте и его создателях"""

CANNOT_REGISTER_NOW = "Вы не можете проходить регистрацию в данный момент."

ARE_YOU_A_STUDENT = 'Вы студент?'

WRITE_TO_BEGIN = 'Напишите /begin, чтобы начать'

WAIT_FOR_NEXT_POLL = 'Ожидайте следующий опрос'

TEXT_ANSWER = ' *(текстовый ответ)*'

NUMBER_ANSWER = ' *(выберите ответ по 10-балльной шкале)*'

ADDITIONAL_QUESTIONS = """Если вы хотите добавить новые вопросы к опросу,
напишите текст вопроса с вопросительным знаком следующим сообщением
либо **нажмите на кнопку, если не хотите добавлять вопрос**."""

PRESS_TO_BEGIN = 'Нажмите на кнопку для начала опроса'

ENTER_FIO = 'Введите ФИО или часть ФИО'

ENTER_GROUP = 'Введите номер группы или часть номера'

ANSWER_LAST_QUESTION = 'Нужно ответить на вопрос в предыдущем сообщении'

NO_TEACHERS_FOUND = 'Преподавателей по данному запросу не найдено. Попробуйте ещё раз.'

SUCCESS_REGISTER = 'Успешно зарегистрирован.'

SAVE_USER_ERROR = 'Ошибка: пользователь уже зарегистрирован.'

TOO_MUCH_TEACHERS = 'Уточните запрос, найдено несколько преподавателей:'

NO_GROUPS_FOUND = 'Групп по данному запросу не найдено. Попробуйте ещё раз.'

TOO_MUCH_GROUPS = 'Уточните запрос, найдено несколько групп:'

THANKS_FOR_POLL = 'Спасибо за прохождение опроса!'
